---
kind: type
id: T:Autodesk.Revit.UI.DockablePanes
source: html/a6e4943e-8a76-92f6-81d3-1d467a1aa701.htm
---
# Autodesk.Revit.UI.DockablePanes

Provides a container of all Revit built-in DockablePaneId instances.

## Syntax (C#)
```csharp
public static class DockablePanes
```